             PGM

/* Create a lock and delay. Called by T9ALLOCMNY        */

             ALCOBJ     OBJ((user1/qclsrc *FILE *SHRRD)) WAIT(0)
             DLYJOB     DLY(180)
             ENDPGM
