PGM
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(200)
             GETOBJUSR  OBJECT(QSYS/USER2) TYPE(*LIB) MSGFLD(&MSG)
             SNDMSG     MSG(&MSG) TOUSR(*REQUESTER)

             ENDPGM
